[
  "Walk on the street in public alone.",
  "Keep your head up and look around while walking instead of down.",
  "Make brief eye contact with a passerby.",
  "Make eye contact and smile slightly.",
  "Order something from a café",
  "Nod politely when someone walks past.",
  "Hold eye contact with someone for one extra second before looking away.",
  "Walk through a public place without checking your phone.",
  "Say “thank you” softly when someone holds a door.",
  "Say “thanks” to a cashier when paying.",
  "Make eye contact while saying “thank you.”",
  "Say “have a nice day” when leaving a shop.",
  "Say “hi” or “hello” to a passerby.",
  "Say “good morning” or “good evening” to someone.",
  "Say “excuse me” clearly when walking past someone.",
  "Thank someone for moving aside.",
  "Ask someone for the time.",
  "Ask someone where the restroom or exit is.",
  "Ask someone, “Is this seat taken?”",
  "Ask someone, “Is this the way to [place]?”",
  "Ask a store employee where to find a common item.",
  "Ask a worker, “Do you sell [item] here?”",
  "Ask a worker, “What time do you close?”",
  "Ask a passerby, “Do you know where the nearest ATM is?”",
  "Ask someone, “Do you know if this bus or train stops at [place]?”",
  "Say, “Thanks for your help — I appreciate it.”",
  "Ask a cashier how their day is going.",
  "Make a neutral comment, like “It’s quiet here today.”",
  "Ask someone which way to the exit or entrance.",
  "Ask someone, “Is this your first time here?”",
  "Ask someone, “Do you think this place is popular?”",
  "Ask someone for help reaching an item on a shelf.",
  "Ask someone if they dropped something (even if it’s not theirs).",
  "Compliment someone briefly, like “Nice shoes!”",
  "Compliment someone on a neutral object, like “That’s a cool backpack.”",
  "Ask a stranger if they recommend something, like “Is that drink good?”",
  "Ask a cashier or barista how long they’ve worked there.",
  "Ask a stranger for change for a coin or bill.",
  "Ask a stranger if they can watch your bag or seat for a moment.",
  "Ask a stranger to take your photo.",
  "Ask someone, “Do you like this area?”",
  "Ask someone what they think of the weather that day.",
  "Ask an employee, “Do you know if it’s usually this busy?”",
  "Ask someone what time public transport usually comes.",
  "Ask someone, “Do you live around here?”",
  "Ask someone for directions you already know.",
  "Ask someone for help carrying something small.",
  "Ask someone for advice on something simple, like “Would you buy this one?”",
  "Ask someone, “Would you get this one or that one?”",
  "Ask a stranger, “Do you know if this place is open late?”",
  "Ask a stranger to take a short video of you.",
  "Ask someone for help taking a better photo, like “Can you get my full outfit?”",
  "Ask someone to recommend something nearby, like “Is there a good café around?”",
  "Ask a street vendor, “What’s the most popular item people get?”",
  "Ask an employee, “What’s your favorite thing on the menu?”",
  "Ask a stranger what they’re drinking or eating, like “Is that coffee good?”",
  "Ask a stranger for their recommendation on a brand or product.",
  "Ask someone which item looks better on you.",
  "Ask someone if they know where to buy something you’re looking for.",
  "Ask a stranger about their pet, like “Your dog’s cute — what breed is it?”",
  "Ask a stranger what kind of phone they use and if they like it.",
  "Ask a stranger what they’re reading or listening to.",
  "Ask a stranger, “Do you know if this area is safe at night?”",
  "Ask someone for feedback, like “Which one suits me more?”",
  "Compliment a stranger and add a follow-up question, like “Nice jacket — where’s it from?”",
  "Make a neutral observation and follow it with a question, like “It’s peaceful here — is it always like this?”",
  "Make a mild joke to a stranger, like “I always walk the wrong way first!”",
  "Ask someone for directions, then ask a follow-up like “Is it far from here?”",
  "Ask a stranger what they recommend in a shop, like “What’s your go-to snack here?”",
  "Ask a stranger for help figuring something out, like a map or sign.",
  "Ask a stranger to explain something, like how to use a ticket machine.",
  "Say something small about yourself, like “I always get turned around here.”",
  "Share a small self-deprecating comment, like “I always manage to drop things.”",
  "Ask someone what kind of music they like.",
  "Ask someone if they’ve been to a nearby place before.",
  "Ask a stranger for advice on two similar options, and discuss their answer.",
  "Ask a stranger if they’ve lived here long.",
  "Ask someone for their opinion on a small choice, like color or size.",
  "Ask someone for help understanding a sign or notice.",
  "Start a brief chat with a stranger, lasting 30 seconds or more.",
  "Ask a stranger what brings them out today.",
  "Ask someone, “Do you come here often?”",
  "Ask someone, “What do you do for work?”",
  "Ask a stranger, “Are you from here originally?”",
  "Ask someone, “What’s your favorite restaurant around here?”",
  "Give a personal compliment, like “You have really nice energy.”",
  "Make a lighthearted joke about the environment, like “This place is always busy, right?”",
  "Ask someone for a small personal favor, like “Can you watch my bag while I step away?”",
  "Ask someone if they think something is worth buying.",
  "Ask for directions, then make small talk afterward, like “Thanks — have you lived here long?”",
  "Handle a rejection or disinterest calmly if someone doesn’t respond.",
  "Politely assert yourself in a small situation, like “Sorry, I think I was here first.”",
  "Start a friendly chat on public transport.",
  "Approach a stranger and compliment their smile or style.",
  "Ask someone to compare two products and share their own opinion.",
  "Start a short conversation and keep it going for two minutes.",
  "Ask someone if they mind chatting for a minute — and sustain it.",
  "Start a short chat and share something about yourself, like “I’m new around here.”",
  "Approach a group of two people and ask a simple question, like “Do you know if this stop is for [destination]?”",
  "Approach a stranger, start a conversation, and keep it going naturally for five minutes."
]
